tut0/tut0.org
#+title: Praktikum Haskell – Einführungsveranstaltung (2017-04-11)

* Organisatorisches
  - Website :: [[https://www.inf.tu-dresden.de/index.php?node_id=3777]]
  - Nutzer :: user
  - Passwort :: monadsAreBurritos
** Module
| Modul      | Studiengang   | Prüfung            | SWS | Name der Lehrveranstaltung                          |
|------------+---------------+--------------------+-----+-----------------------------------------------------|
| INF-B-510  | Bachelor      | Prüfung (mündlich) |   4 | Praktikum Verarbeitung natürlicher Sprachen         |
| INF-B-520  | Bachelor      | Prüfung (mündlich) |   4 | Praktikum Verarbeitung natürlicher Sprachen         |
| INF-D-940  | Diplom        | Prüfung (mündlich) |   4 | Praktikum Verarbeitung natürlicher Sprachen         |
| INF-MA-PR  | Master        | Kolloquium         |   4 | Praktikum Verarbeitung natürlicher Sprachen         |
|------------+---------------+--------------------+-----+-----------------------------------------------------|
| INF-PM-FPG | Master/Diplom | Kolloquium         |   8 | Forschungsprojekt Verarbeitung natürlicher Sprachen |
| INF-MA-PR  | Master        | Kolloquium         |   8 | Master-Praktikum Verarbeitung natürlicher Sprachen  |

** Timetable
  - Teil I :: Vorbereitung für selbstständige Lösung der Abschlussaufgabe
    - 2017-04-11:  Einführungsveranstaltung (Organisatorisches, ghc, ghci)
    - 2017-04-18:  Tutorium 1 (Grundlagen, Typen, Rekursion)
    - 2017-05-02:  Tutorium 2 (einfache Typklassen, Kinds, Lazy Evaluation)
    - 2017-05-16:  Tutorium 3 (Monaden)
    - 2017-05-23:  Tutorium 4 (Profiling, Coding Style, Modules), Erteilen der Abschlussaufgabe
  - Teil II :: selbstständige Lösung der Abschlussaufgabe
    - individuelle Codeinspektion (26. Kalenderwoche)
    - Abschlussveranstaltung (28. Kalenderwoche)

* Grundlagen
** technische Grundlagen
   Computer mit /Haskell-Compiler/ (z.B. ghc), /cabal/, /Terminal/ (z.B. xterm) und /Editor/ (z.B. emacs)
  - Installation ::
    - unter Linux:  obige Pakete mir dem Paketmanager installieren
    - unter Windows oder Mac:  siehe https://www.haskell.org/platform/ (*viel Glück!*)
** Programme
  - ghci  :: interactiver Haskell-Interpreter
    - :h        :: Hilfe anzeigen
    - :t <exp>  :: Typ des Ausdrucks <exp> zeigen
    - :i <func> :: Informationen zu der Funktion <func> anzeigen
  - ghc   :: Glasgow Haskell-Compiler
  - cabal :: Paketmanager (zur Installation von Programmen und Bibliotheken)
    - cabal init                        :: initialisiert ein neues Haskell-Projekt (/mit/ „informative comments“)
    - cabal configure                   :: konfiguriert die build-Umgebung
    - cabal build                       :: kompiliert das Projekt
    - cabal run                         :: kompiliert das Projekt und startet die Executable
    - cabal sandbox init                :: erstellt eine Sandbox im aktuellen Ordner
    - cabal update                      :: updated die Paketliste
    - cabal install <packages>          :: installiert die Pakete <packages>
    - cabal install --only-dependencies :: installiert Dependencies des aktuellen Projekts

* Leseauftrag
  - Literatur :: [LYaH12, Kap. 1–4], [PHfNLP15, Folien I/1–55]
  - Aufgaben  :: [PHfNLP15, Folien I/30, I/33, I/35, I/37, I/45–46, I/53)]

* Literatur
  - [LYaH12]   :: Miran Lipovača: Learn You a Haskell for Great Good, 2012, <http://learnyouahaskell.com/>.
  - [PHfNLP15] :: Toni Dietze: Praktikum Haskell für NLP, Foliensatz, 2015. 

