tut0/tut0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-20 Do 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Praktikum Haskell – Einführungsveranstaltung (2017-04-11)</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Praktikum Haskell – Einführungsveranstaltung (2017-04-11)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0d4db8">1. Organisatorisches</a>
<ul>
<li><a href="#org687c367">1.1. Module</a></li>
<li><a href="#orgd2216c1">1.2. Timetable</a></li>
</ul>
</li>
<li><a href="#org1f72bea">2. Grundlagen</a>
<ul>
<li><a href="#org161c292">2.1. technische Grundlagen</a></li>
<li><a href="#orgf89a9f8">2.2. Programme</a></li>
</ul>
</li>
<li><a href="#orgfa60345">3. Leseauftrag</a></li>
<li><a href="#org1b0652a">4. Literatur</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc0d4db8" class="outline-2">
<h2 id="orgc0d4db8"><span class="section-number-2">1</span> Organisatorisches</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt>Website</dt><dd><a href="https://www.inf.tu-dresden.de/index.php?node_id=3777">https://www.inf.tu-dresden.de/index.php?node_id=3777</a></dd>
</dl>
</div>

<div id="outline-container-org687c367" class="outline-3">
<h3 id="org687c367"><span class="section-number-3">1.1</span> Module</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modul</th>
<th scope="col" class="org-left">Studiengang</th>
<th scope="col" class="org-left">Prüfung</th>
<th scope="col" class="org-right">SWS</th>
<th scope="col" class="org-left">Name der Lehrveranstaltung</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">INF-B-510</td>
<td class="org-left">Bachelor</td>
<td class="org-left">Prüfung (mündlich)</td>
<td class="org-right">4</td>
<td class="org-left">Praktikum Verarbeitung natürlicher Sprachen</td>
</tr>

<tr>
<td class="org-left">INF-B-520</td>
<td class="org-left">Bachelor</td>
<td class="org-left">Prüfung (mündlich)</td>
<td class="org-right">4</td>
<td class="org-left">Praktikum Verarbeitung natürlicher Sprachen</td>
</tr>

<tr>
<td class="org-left">INF-D-940</td>
<td class="org-left">Diplom</td>
<td class="org-left">Prüfung (mündlich)</td>
<td class="org-right">4</td>
<td class="org-left">Praktikum Verarbeitung natürlicher Sprachen</td>
</tr>

<tr>
<td class="org-left">INF-MA-PR</td>
<td class="org-left">Master</td>
<td class="org-left">Kolloquium</td>
<td class="org-right">4</td>
<td class="org-left">Praktikum Verarbeitung natürlicher Sprachen</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INF-PM-FPG</td>
<td class="org-left">Master/Diplom</td>
<td class="org-left">Kolloquium</td>
<td class="org-right">8</td>
<td class="org-left">Forschungsprojekt Verarbeitung natürlicher Sprachen</td>
</tr>

<tr>
<td class="org-left">INF-MA-PR</td>
<td class="org-left">Master</td>
<td class="org-left">Kolloquium</td>
<td class="org-right">8</td>
<td class="org-left">Master-Praktikum Verarbeitung natürlicher Sprachen</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd2216c1" class="outline-3">
<h3 id="orgd2216c1"><span class="section-number-3">1.2</span> Timetable</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>Teil I</dt><dd>Vorbereitung für selbstständige Lösung der Abschlussaufgabe
<ul class="org-ul">
<li>2017-04-11:  Einführungsveranstaltung (Organisatorisches, ghc, ghci)</li>
<li>2017-04-18:  Tutorium 1 (Grundlagen, Typen, Rekursion)</li>
<li>2017-05-02:  Tutorium 2 (einfache Typklassen, Kinds, Lazy Evaluation)</li>
<li>2017-05-16:  Tutorium 3 (Monaden)</li>
<li>2017-05-23:  Tutorium 4 (Profiling, Coding Style, Modules), Erteilen der Abschlussaufgabe</li>
</ul></dd>
<dt>Teil II</dt><dd>selbstständige Lösung der Abschlussaufgabe
<ul class="org-ul">
<li>individuelle Codeinspektion (26. Kalenderwoche)</li>
<li>Abschlussveranstaltung (28. Kalenderwoche)</li>
</ul></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org1f72bea" class="outline-2">
<h2 id="org1f72bea"><span class="section-number-2">2</span> Grundlagen</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org161c292" class="outline-3">
<h3 id="org161c292"><span class="section-number-3">2.1</span> technische Grundlagen</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Computer mit <i>Haskell-Compiler</i> (z.B. ghc), <i>cabal</i>, <i>Terminal</i> (z.B. xterm) und <i>Editor</i> (z.B. emacs)
</p>
<dl class="org-dl">
<dt>Installation</dt><dd><ul class="org-ul">
<li>unter Linux:  obige Pakete mir dem Paketmanager installieren</li>
<li>unter Windows oder Mac:  siehe <a href="https://www.haskell.org/platform/">https://www.haskell.org/platform/</a> (<b>viel Glück!</b>)</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgf89a9f8" class="outline-3">
<h3 id="orgf89a9f8"><span class="section-number-3">2.2</span> Programme</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt>ghci </dt><dd>interactiver Haskell-Interpreter
<dl class="org-dl">
<dt>:h       </dt><dd>Hilfe anzeigen</dd>
<dt>:t &lt;exp&gt; </dt><dd>Typ des Ausdrucks &lt;exp&gt; zeigen</dd>
<dt>:i &lt;func&gt;</dt><dd>Informationen zu der Funktion &lt;func&gt; anzeigen</dd>
</dl></dd>
<dt>ghc  </dt><dd>Glasgow Haskell-Compiler</dd>
<dt>cabal</dt><dd>Paketmanager (zur Installation von Programmen und Bibliotheken)
<dl class="org-dl">
<dt>cabal init                       </dt><dd>initialisiert ein neues Haskell-Projekt (<i>mit</i> „informative comments“)</dd>
<dt>cabal configure                  </dt><dd>konfiguriert die build-Umgebung</dd>
<dt>cabal build                      </dt><dd>kompiliert das Projekt</dd>
<dt>cabal run                        </dt><dd>kompiliert das Projekt und startet die Executable</dd>
<dt>cabal sandbox init               </dt><dd>erstellt eine Sandbox im aktuellen Ordner</dd>
<dt>cabal update                     </dt><dd>updated die Paketliste</dd>
<dt>cabal install &lt;packages&gt;         </dt><dd>installiert die Pakete &lt;packages&gt;</dd>
<dt>cabal install &#x2013;only-dependencies</dt><dd>installiert Dependencies des aktuellen Projekts</dd>
</dl></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgfa60345" class="outline-2">
<h2 id="orgfa60345"><span class="section-number-2">3</span> Leseauftrag</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt>Literatur</dt><dd>[LYaH12, Kap. 1–4], [PHfNLP15, Folien I/1–55]</dd>
<dt>Aufgaben </dt><dd>[PHfNLP15, Folien I/30, I/33, I/35, I/37, I/45–46, I/53)]</dd>
</dl>
</div>
</div>

<div id="outline-container-org1b0652a" class="outline-2">
<h2 id="org1b0652a"><span class="section-number-2">4</span> Literatur</h2>
<div class="outline-text-2" id="text-4">
<dl class="org-dl">
<dt>[LYaH12]  </dt><dd>Miran Lipovača: Learn You a Haskell for Great Good, 2012, <a href="http://learnyouahaskell.com/">http://learnyouahaskell.com/</a>.</dd>
<dt>[PHfNLP15]</dt><dd>Toni Dietze: Praktikum Haskell für NLP, Foliensatz, 2015.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-04-20 Do 16:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
